tsung_offtherails.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/opt/homebrew/Cellar/tsung/1.7.0/share/tsung/tsung-1.0.dtd">

<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <!--TODO: replace cs291.com with eb url-->
    <server host="bryanxu.eba-pqkhfm2c.us-west-2.elasticbeanstalk.com" port="80" type="tcp"></server>
  </servers>
  
  <load>
    <arrivalphase phase="1" duration="1" unit="minute">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="2" duration="1" unit="minute">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="3" duration="1" unit="minute">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="4" duration="1" unit="minute">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="5" duration="1" unit="minute">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="1" unit="minute">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="1" unit="minute">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <!-- <arrivalphase phase="8" duration="1" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase> -->
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <!--This session simulates a logged-in user browsing through the items on the homepage.-->
    <session name="scenario_1" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="250">
        <var name="rand_page" />
      </setdynvars>
      <request subst="true"><http method="POST" url="/login/" content_type="application/json" contents="{&quot;first_name&quot;:&quot;&quot;,&quot;last_name&quot;:&quot;&quot;,&quot;email&quot;:&quot;e%%_rand_n%%@mail.com&quot;,&quot;password&quot;:&quot;pw&quot;,&quot;password_confirmation&quot;:&quot;&quot;}"></http></request>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!--This session simulates a non-logged in user browsing through items on the homepage.-->
    <session name="scenario_2" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="250">
        <var name="rand_page" />
      </setdynvars>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="GET" url="/items/%%_rand_n1%%/"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="GET" url="/items/%%_rand_n2%%/"></http></request>
    </session>

    <!--This session simulates an authenticated user viewing and purchasing one item, then looking at their purchase history.-->
    <session name="scenario_3" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="10">
        <var name="rand_order_id" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="250">
        <var name="rand_page" />
      </setdynvars>

      <request subst="true"><http method="POST" url="/login/" content_type="application/json" contents="{&quot;first_name&quot;:&quot;&quot;,&quot;last_name&quot;:&quot;&quot;,&quot;email&quot;:&quot;e%%_rand_n1%%@mail.com&quot;,&quot;password&quot;:&quot;pw&quot;,&quot;password_confirmation&quot;:&quot;&quot;}"></http></request>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>

      <thinktime value="3" random="true"></thinktime>
      <request subst="true">
        <http method="GET" url="/items/%%_rand_n2%%/"></http>
      </request>

      <request subst="true">
        <http method="GET" content_type="application/json" url="/current_order?user_id=%%_rand_n1%%"></http>
      </request>

      <!--Fetch the item!-->
      <request subst="true"><http method="POST" content_type="application/json" url="/order_items/" contents="{&quot;order_item&quot;:{&quot;quantity&quot;:1,&quot;order_id&quot;:%%_rand_order_id%%,&quot;item_id&quot;:&quot;%%_rand_n2%%&quot;}}"></http></request>
      <request subst="true"><http method="PATCH" content_type="application/json" url="/orders/%%_rand_order_id%%/" contents="{&quot;user_id&quot;:%%_rand_n1%%,&quot;purchased&quot;:true}"></http></request>
      <thinktime value="3" random="true"></thinktime>

      <!--View purchase history-->
      <request subst="true"><http method="GET" url="/order_history/%%_rand_order_id%%/"></http></request>
      <!--Logout-->
      <thinktime value="3" random="true"></thinktime>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!-- This session simulates an authenticated user creating, updating, and deleting a new item listing.-->
    <session name="scenario_4" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="1010">
        <var name="rand_item_id" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="250">
        <var name="rand_page" />
      </setdynvars>

      <request subst="true"><http method="POST" url="/login/" content_type="application/json" contents="{&quot;first_name&quot;:&quot;&quot;,&quot;last_name&quot;:&quot;&quot;,&quot;email&quot;:&quot;e%%_rand_n1%%@mail.com&quot;,&quot;password&quot;:&quot;pw&quot;,&quot;password_confirmation&quot;:&quot;&quot;}"></http></request>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>
      <request subst="true">
        <http method="POST" url="/items/" content_type="application/json" contents="{&quot;name&quot;:&quot;a&quot;,&quot;price&quot;:&quot;1&quot;,&quot;quantity&quot;:&quot;1&quot;,&quot;show&quot;:true,&quot;image_link&quot;:&quot;hello&quot;,&quot;seller_id&quot;:%%_rand_n1%%}"></http>
      </request>
      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="PATCH" content_type="application/json" url="/items/%%_rand_item_id%%/" contents="{&quot;name&quot;:&quot;b&quot;,&quot;price&quot;:&quot;1&quot;,&quot;quantity&quot;:&quot;1&quot;,&quot;show&quot;:true,&quot;image_link&quot;:&quot;hello&quot;,&quot;seller_id&quot;:%%_rand_n1%%}"></http></request>
      <request><http method="POST" url="/logout/"></http></request>
    </session>

    <!--This session simulates an authenticated user leaving a review, editing their review, then deleting it.-->
    <session name="scenario_5" type="ts_http" weight="1">
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n1" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="rand_n2" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="100">
        <var name="my_review_id" />
      </setdynvars>
      <setdynvars sourcetype="random_number" start="1" end="250">
        <var name="rand_page" />
      </setdynvars>

      <request subst="true"><http method="POST" url="/login/" content_type="application/json" contents="{&quot;first_name&quot;:&quot;&quot;,&quot;last_name&quot;:&quot;&quot;,&quot;email&quot;:&quot;e%%_rand_n1%%@mail.com&quot;,&quot;password&quot;:&quot;pw&quot;,&quot;password_confirmation&quot;:&quot;&quot;}"></http></request>
      <request><http method="GET" url="/items/page/%%_rand_page%%"></http></request>
      <request subst="true"><http method="GET" url="/items/%%_rand_n2%%/"></http></request>
      
      <request subst="true">
        <http method="POST" url="/ratings/" content_type="application/json" contents="{&quot;comment&quot;:&quot;&quot;, &quot;score&quot;:&quot;5&quot;, &quot;item_id&quot;:&quot;%%_rand_n2%%&quot;, &quot;user_id&quot;:&quot;%%_rand_n1%%&quot;}"></http>
      </request>

      <thinktime value="3" random="true"></thinktime>
      <request subst="true"><http method="PATCH" url="/ratings/%%_my_review_id%%/" contents="{&quot;comment&quot;:&quot;&quot;, &quot;score&quot;:&quot;3&quot;, &quot;item_id&quot;:&quot;%%_rand_n2%%&quot;, &quot;user_id&quot;:&quot;%%_rand_n1%%&quot;}"></http></request>
      <request><http method="POST" url="/logout/"></http></request>
    </session>
  </sessions>
</tsung>